# Processing Police Killings Data

In [1]:
import pandas as pd

In [2]:
data = pd.read_json('a3cleanedonly2015.json')

In [4]:
data.head()

,FIELD1,Unnamed: 0,UID,Name,Age,Gender,Race,Date,City,State,Manner_of_death,Armed,Mental_illness,Flee
0,103,104,9978,Tim Elliott,53.0,Male,Asian,2015-01-02,Shelton,WA,Shot,,True,False
1,104,105,10077,Hung Trieu,NaN,Male,Asian,2015-02-01,Houston,TX,Shot,,False,False
2,105,106,10374,Lue Vang,39.0,Male,Asian,2015-04-22,Eldorado Springs,CO,Shot,,False,False
3,106,107,10421,Thong Kien Ma,32.0,Male,Asian,2015-05-05,South El Monte,CA,Shot,,False,False
4,107,108,10628,Ton Nguyen,60.0,Male,Asian,2015-07-02,San Diego,CA,Shot,,False,False

In [55]:
data.groupby(['Race'])['Race'].count()

Race
            114
Asian        19
Black       378
Hispanic    246
Native       19
Other        10
White       751
Name: Race, dtype: int64

In [36]:
mental_illness_dist = data.groupby(['Mental_illness'])['Mental_illness'].count()

In [39]:
ment_ill = pd.DataFrame(mental_illness_dist)

In [43]:
ment_ill = ment_ill.rename(columns = {"Mental_illness": "Amount"})

In [44]:
ment_ill

                Amount
Mental_illness
False             1210
True               327

In [54]:
ment_ill.to_json("ment_ill.json", orient="index")

pandas.core.frame.DataFrame